{
  "class_name": "Sequential",
  "config": {
    "name": "sequential",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null,{{data.input.input_dim|join(',')}}],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "layer_input"
        }
      },
      {% if data.flatten %}
      {
        "class_name": "Flatten",
        "config": {
          "name": "flatten",
          "trainable": true,
          "batch_input_shape": [null,{{data.flatten.input_dim|join(',')}}],
          "dtype": "float32",
          "data_format": "channels_last"
        }
      },
      {% endif %}

      {% for layer in data.dense %}
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_id_{{layer.id}}",
          "trainable": true,
          "dtype": "float32",
          "units": {{layer.units}},
          "activation": "{{layer.activation}}",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {% endfor %}
    ]
  },
  "keras_version": "2.5.0",
  "backend": "tensorflow"
}
