{
  "class_name": "Functional",
  "config": {
    "name": "model",
    "trainable": true,
    "layers": [],
    "input_layers": [],
    "output_layers": []
  },
  "keras_version": "2.12.0",
  "backend": "tensorflow"
}